HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI1 */
#define IFX_PSI5_CRCIOV_CRCI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI1 */
#define IFX_PSI5_CRCIOV_CRCI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI1 */
#define IFX_PSI5_CRCIOV_CRCI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI25 */
#define IFX_PSI5_CRCIOV_CRCI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI26 */
#define IFX_PSI5_CRCIOV_CRCI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI27 */
#define IFX_PSI5_CRCIOV_CRCI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI28 */
#define IFX_PSI5_CRCIOV_CRCI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI29 */
#define IFX_PSI5_CRCIOV_CRCI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI2 */
#define IFX_PSI5_CRCIOV_CRCI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI2 */
#define IFX_PSI5_CRCIOV_CRCI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI2 */
#define IFX_PSI5_CRCIOV_CRCI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI30 */
#define IFX_PSI5_CRCIOV_CRCI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI31 */
#define IFX_PSI5_CRCIOV_CRCI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI31 */
#define IFX_PSI5_CRCIOV_CRCI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI31 */
#define IFX_PSI5_CRCIOV_CRCI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI3 */
#define IFX_PSI5_CRCIOV_CRCI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI3 */
#define IFX_PSI5_CRCIOV_CRCI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI3 */
#define IFX_PSI5_CRCIOV_CRCI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI4 */
#define IFX_PSI5_CRCIOV_CRCI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI4 */
#define IFX_PSI5_CRCIOV_CRCI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI4 */
#define IFX_PSI5_CRCIOV_CRCI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI5 */
#define IFX_PSI5_CRCIOV_CRCI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI5 */
#define IFX_PSI5_CRCIOV_CRCI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI5 */
#define IFX_PSI5_CRCIOV_CRCI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI6 */
#define IFX_PSI5_CRCIOV_CRCI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI6 */
#define IFX_PSI5_CRCIOV_CRCI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI6 */
#define IFX_PSI5_CRCIOV_CRCI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_MSK (0x1)

