HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_bf.h
/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI0 */
#define IFX_PSI5_NBISET_NBI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI0 */
#define IFX_PSI5_NBISET_NBI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI0 */
#define IFX_PSI5_NBISET_NBI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI10 */
#define IFX_PSI5_NBISET_NBI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI10 */
#define IFX_PSI5_NBISET_NBI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI10 */
#define IFX_PSI5_NBISET_NBI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI11 */
#define IFX_PSI5_NBISET_NBI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI11 */
#define IFX_PSI5_NBISET_NBI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI11 */
#define IFX_PSI5_NBISET_NBI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI12 */
#define IFX_PSI5_NBISET_NBI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI12 */
#define IFX_PSI5_NBISET_NBI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI12 */
#define IFX_PSI5_NBISET_NBI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI13 */
#define IFX_PSI5_NBISET_NBI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI13 */
#define IFX_PSI5_NBISET_NBI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI13 */
#define IFX_PSI5_NBISET_NBI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI14 */
#define IFX_PSI5_NBISET_NBI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI14 */
#define IFX_PSI5_NBISET_NBI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI14 */
#define IFX_PSI5_NBISET_NBI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI15 */
#define IFX_PSI5_NBISET_NBI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI15 */
#define IFX_PSI5_NBISET_NBI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI15 */
#define IFX_PSI5_NBISET_NBI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI16 */
#define IFX_PSI5_NBISET_NBI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI16 */
#define IFX_PSI5_NBISET_NBI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI16 */
#define IFX_PSI5_NBISET_NBI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI17 */
#define IFX_PSI5_NBISET_NBI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI17 */
#define IFX_PSI5_NBISET_NBI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI17 */
#define IFX_PSI5_NBISET_NBI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI18 */
#define IFX_PSI5_NBISET_NBI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI18 */
#define IFX_PSI5_NBISET_NBI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI18 */
#define IFX_PSI5_NBISET_NBI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI19 */
#define IFX_PSI5_NBISET_NBI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI19 */
#define IFX_PSI5_NBISET_NBI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI19 */
#define IFX_PSI5_NBISET_NBI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI1 */
#define IFX_PSI5_NBISET_NBI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI1 */
#define IFX_PSI5_NBISET_NBI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI1 */
#define IFX_PSI5_NBISET_NBI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI20 */
#define IFX_PSI5_NBISET_NBI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI20 */
#define IFX_PSI5_NBISET_NBI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI20 */
#define IFX_PSI5_NBISET_NBI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI21 */
#define IFX_PSI5_NBISET_NBI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI21 */
#define IFX_PSI5_NBISET_NBI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI21 */
#define IFX_PSI5_NBISET_NBI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI22 */
#define IFX_PSI5_NBISET_NBI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI22 */
#define IFX_PSI5_NBISET_NBI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI22 */
#define IFX_PSI5_NBISET_NBI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI23 */
#define IFX_PSI5_NBISET_NBI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI23 */
#define IFX_PSI5_NBISET_NBI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI23 */
#define IFX_PSI5_NBISET_NBI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI24 */
#define IFX_PSI5_NBISET_NBI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI24 */
#define IFX_PSI5_NBISET_NBI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI24 */
#define IFX_PSI5_NBISET_NBI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI25 */
#define IFX_PSI5_NBISET_NBI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI25 */
#define IFX_PSI5_NBISET_NBI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI25 */
#define IFX_PSI5_NBISET_NBI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI26 */
#define IFX_PSI5_NBISET_NBI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI26 */
#define IFX_PSI5_NBISET_NBI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI26 */
#define IFX_PSI5_NBISET_NBI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI27 */
#define IFX_PSI5_NBISET_NBI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI27 */
#define IFX_PSI5_NBISET_NBI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI27 */
#define IFX_PSI5_NBISET_NBI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI28 */
#define IFX_PSI5_NBISET_NBI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI28 */
#define IFX_PSI5_NBISET_NBI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI28 */
#define IFX_PSI5_NBISET_NBI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI29 */
#define IFX_PSI5_NBISET_NBI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI29 */
#define IFX_PSI5_NBISET_NBI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI29 */
#define IFX_PSI5_NBISET_NBI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI2 */
#define IFX_PSI5_NBISET_NBI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI2 */
#define IFX_PSI5_NBISET_NBI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI2 */
#define IFX_PSI5_NBISET_NBI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI30 */
#define IFX_PSI5_NBISET_NBI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI30 */
#define IFX_PSI5_NBISET_NBI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI30 */
#define IFX_PSI5_NBISET_NBI30_OFF (30)

