HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI4 */
#define IFX_PSI5_NFIOV_NFI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI5 */
#define IFX_PSI5_NFIOV_NFI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI5 */
#define IFX_PSI5_NFIOV_NFI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI5 */
#define IFX_PSI5_NFIOV_NFI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI6 */
#define IFX_PSI5_NFIOV_NFI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI6 */
#define IFX_PSI5_NFIOV_NFI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI6 */
#define IFX_PSI5_NFIOV_NFI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI7 */
#define IFX_PSI5_NFIOV_NFI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI7 */
#define IFX_PSI5_NFIOV_NFI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI7 */
#define IFX_PSI5_NFIOV_NFI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI8 */
#define IFX_PSI5_NFIOV_NFI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI8 */
#define IFX_PSI5_NFIOV_NFI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI8 */
#define IFX_PSI5_NFIOV_NFI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI9 */
#define IFX_PSI5_NFIOV_NFI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI9 */
#define IFX_PSI5_NFIOV_NFI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI9 */
#define IFX_PSI5_NFIOV_NFI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI0 */
#define IFX_PSI5_NFISET_NFI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI0 */
#define IFX_PSI5_NFISET_NFI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI0 */
#define IFX_PSI5_NFISET_NFI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI10 */
#define IFX_PSI5_NFISET_NFI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI10 */
#define IFX_PSI5_NFISET_NFI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI10 */
#define IFX_PSI5_NFISET_NFI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI11 */
#define IFX_PSI5_NFISET_NFI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI11 */
#define IFX_PSI5_NFISET_NFI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI11 */
#define IFX_PSI5_NFISET_NFI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI12 */
#define IFX_PSI5_NFISET_NFI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI12 */
#define IFX_PSI5_NFISET_NFI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI12 */
#define IFX_PSI5_NFISET_NFI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI13 */
#define IFX_PSI5_NFISET_NFI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI13 */
#define IFX_PSI5_NFISET_NFI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI13 */
#define IFX_PSI5_NFISET_NFI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI14 */
#define IFX_PSI5_NFISET_NFI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI14 */
#define IFX_PSI5_NFISET_NFI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI14 */
#define IFX_PSI5_NFISET_NFI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI15 */
#define IFX_PSI5_NFISET_NFI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI15 */
#define IFX_PSI5_NFISET_NFI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI15 */
#define IFX_PSI5_NFISET_NFI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI16 */
#define IFX_PSI5_NFISET_NFI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI16 */
#define IFX_PSI5_NFISET_NFI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI16 */
#define IFX_PSI5_NFISET_NFI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI17 */
#define IFX_PSI5_NFISET_NFI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI17 */
#define IFX_PSI5_NFISET_NFI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI17 */
#define IFX_PSI5_NFISET_NFI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI18 */
#define IFX_PSI5_NFISET_NFI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI18 */
#define IFX_PSI5_NFISET_NFI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI18 */
#define IFX_PSI5_NFISET_NFI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI19 */
#define IFX_PSI5_NFISET_NFI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI19 */
#define IFX_PSI5_NFISET_NFI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI19 */
#define IFX_PSI5_NFISET_NFI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI1 */
#define IFX_PSI5_NFISET_NFI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI1 */
#define IFX_PSI5_NFISET_NFI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI1 */
#define IFX_PSI5_NFISET_NFI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI20 */
#define IFX_PSI5_NFISET_NFI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI20 */
#define IFX_PSI5_NFISET_NFI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI20 */
#define IFX_PSI5_NFISET_NFI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI21 */
#define IFX_PSI5_NFISET_NFI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI21 */
#define IFX_PSI5_NFISET_NFI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI21 */
#define IFX_PSI5_NFISET_NFI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI22 */
#define IFX_PSI5_NFISET_NFI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI22 */
#define IFX_PSI5_NFISET_NFI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI22 */
#define IFX_PSI5_NFISET_NFI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI23 */
#define IFX_PSI5_NFISET_NFI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI23 */
#define IFX_PSI5_NFISET_NFI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI23 */
#define IFX_PSI5_NFISET_NFI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI24 */
#define IFX_PSI5_NFISET_NFI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI24 */
#define IFX_PSI5_NFISET_NFI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI24 */
#define IFX_PSI5_NFISET_NFI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI25 */
#define IFX_PSI5_NFISET_NFI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI25 */
#define IFX_PSI5_NFISET_NFI25_MSK (0x1)

