HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI8 */
#define IFX_PSI5_RMICLR_RMI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI8 */
#define IFX_PSI5_RMICLR_RMI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI8 */
#define IFX_PSI5_RMICLR_RMI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI9 */
#define IFX_PSI5_RMICLR_RMI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI9 */
#define IFX_PSI5_RMICLR_RMI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI9 */
#define IFX_PSI5_RMICLR_RMI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI0 */
#define IFX_PSI5_RMIOV_RMI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI10 */
#define IFX_PSI5_RMIOV_RMI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI11 */
#define IFX_PSI5_RMIOV_RMI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI12 */
#define IFX_PSI5_RMIOV_RMI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI13 */
#define IFX_PSI5_RMIOV_RMI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI14 */
#define IFX_PSI5_RMIOV_RMI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI15 */
#define IFX_PSI5_RMIOV_RMI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI16 */
#define IFX_PSI5_RMIOV_RMI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI17 */
#define IFX_PSI5_RMIOV_RMI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI18 */
#define IFX_PSI5_RMIOV_RMI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI19 */
#define IFX_PSI5_RMIOV_RMI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI1 */
#define IFX_PSI5_RMIOV_RMI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI20 */
#define IFX_PSI5_RMIOV_RMI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI21 */
#define IFX_PSI5_RMIOV_RMI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI22 */
#define IFX_PSI5_RMIOV_RMI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI23 */
#define IFX_PSI5_RMIOV_RMI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI24 */
#define IFX_PSI5_RMIOV_RMI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI25 */
#define IFX_PSI5_RMIOV_RMI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI26 */
#define IFX_PSI5_RMIOV_RMI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI27 */
#define IFX_PSI5_RMIOV_RMI27_OFF (27)

