HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI28 */
#define IFX_PSI5_RMIOV_RMI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI29 */
#define IFX_PSI5_RMIOV_RMI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI2 */
#define IFX_PSI5_RMIOV_RMI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI30 */
#define IFX_PSI5_RMIOV_RMI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI31 */
#define IFX_PSI5_RMIOV_RMI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI3 */
#define IFX_PSI5_RMIOV_RMI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI4 */
#define IFX_PSI5_RMIOV_RMI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI5 */
#define IFX_PSI5_RMIOV_RMI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI6 */
#define IFX_PSI5_RMIOV_RMI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI7 */
#define IFX_PSI5_RMIOV_RMI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI8 */
#define IFX_PSI5_RMIOV_RMI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMIOV_Bits.RMI9 */
#define IFX_PSI5_RMIOV_RMI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI0 */
#define IFX_PSI5_RMISET_RMI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI10 */
#define IFX_PSI5_RMISET_RMI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI10 */
#define IFX_PSI5_RMISET_RMI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI10 */
#define IFX_PSI5_RMISET_RMI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI11 */
#define IFX_PSI5_RMISET_RMI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI11 */
#define IFX_PSI5_RMISET_RMI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI11 */
#define IFX_PSI5_RMISET_RMI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI12 */
#define IFX_PSI5_RMISET_RMI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI12 */
#define IFX_PSI5_RMISET_RMI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI12 */
#define IFX_PSI5_RMISET_RMI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI13 */
#define IFX_PSI5_RMISET_RMI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI13 */
#define IFX_PSI5_RMISET_RMI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI13 */
#define IFX_PSI5_RMISET_RMI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI14 */
#define IFX_PSI5_RMISET_RMI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI14 */
#define IFX_PSI5_RMISET_RMI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI14 */
#define IFX_PSI5_RMISET_RMI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI15 */
#define IFX_PSI5_RMISET_RMI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI15 */
#define IFX_PSI5_RMISET_RMI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI15 */
#define IFX_PSI5_RMISET_RMI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI16 */
#define IFX_PSI5_RMISET_RMI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI16 */
#define IFX_PSI5_RMISET_RMI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI16 */
#define IFX_PSI5_RMISET_RMI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI17 */
#define IFX_PSI5_RMISET_RMI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI17 */
#define IFX_PSI5_RMISET_RMI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI17 */
#define IFX_PSI5_RMISET_RMI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI18 */
#define IFX_PSI5_RMISET_RMI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI18 */
#define IFX_PSI5_RMISET_RMI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMISET_Bits.RMI18 */
#define IFX_PSI5_RMISET_RMI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_RMISET_Bits.RMI19 */
#define IFX_PSI5_RMISET_RMI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMISET_Bits.RMI19 */
#define IFX_PSI5_RMISET_RMI19_MSK (0x1)

